In [40]:
import numpy as np
import pandas as pd

In [41]:
df=pd.read_csv("income.csv")
df

        Name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [42]:
df.Income.mean()

1433928.5714285714

In [43]:
df.Income.median()

7000.0

In [44]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [45]:
df.Income.quantile(0)

4000.0

In [46]:
df.Income.quantile(.25)

5500.0

In [47]:
df.Income.quantile(.50)

7000.0

In [48]:
df.Income.quantile(.75)

7750.0

In [49]:
df.Income.quantile(1)

10000000.0

In [51]:
percentile_90=df.Income.quantile(.90)
percentile_90

4004800.0000000037

In [54]:
new_df=df[df.Income<=percentile_90]
new_df

    Name  Income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [55]:
df['Income'][3]=np.nan

C:\Users\User\AppData\Local\Temp\ipykernel_7612\932255874.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Income'][3]=np.nan
C:\Users\User\AppData\Local\Temp\ipykernel_7612\932255874.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Income'][3]=np.nan

In [56]:
df

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [57]:
df.fillna(df.Income.median())

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0